{"data":{"contentfulPost":{"id":"6dfb6ab5-d96f-57b2-bf40-df6a8ad28506","fields":{"bodyFormatted":"<p>Do you know Jesus created all things visible (universe, earth, life) and all things invisible (angels, authorities)?</p>\n<blockquote>\n<p>Hebrews 11:3</p>\n<p><strong>By faith we understand</strong> that <strong>the universe was created by the word of God</strong>, so that <strong>what is seen</strong> was not made out of <strong>things that are visible</strong>.</p>\n</blockquote>\n<p>When we look at visible things we see design and order which do not happen by chance or  long periods of time.  Atheist author, Richard Dawkins, admitted that nature looks designed.  The Father of Quantum Mechanics, Werner Heisenberg, said:  &quot;What we observe is not nature itself, but nature exposed to our method of questioning&quot;.  If our method of questioning involves a Designer, who can be known, then we can be honest about what we observe.   Life on Earth looks complex and designed because it is complex and designed by God and the one given credit for speaking it all into existence is the invisible Word who became visible flesh and dwelt among us.</p>\n<p>Paul talking about Jesus:</p>\n<blockquote>\n<p>Colossians 1:16</p>\n<p>For <strong>everything was created by Him</strong>, in heaven and on earth, the visible and the invisible, whether thrones or dominions or rulers or authorities—<strong>all things have been created through Him</strong> and <strong>for Him</strong>.</p>\n</blockquote>\n<p>The Disciple John talking about Jesus:</p>\n<blockquote>\n<p>John 1:1-4</p>\n<p><strong>In the beginning was the Word</strong>, and <strong>the Word was with God</strong>, and <strong>the Word was God</strong>. He was with God in the beginning. <strong>All things were created through Him</strong>, and <strong>apart from Him not one thing was created</strong> that has been created. Life was in Him, and that life was the light of men.</p>\n</blockquote>\n<p>Jesus talking about himself:</p>\n<p>Rev. 3:14 &quot;<strong>The Amen</strong>, the faithful and true Witness, <strong>the Originator of God’s creation</strong> says . . .&quot;  and in Revelation 22:13 he says of himself again:  &quot;<strong>I am the Alpha and the Omega, the First and the Last, the Beginning and the End.</strong>&quot;</p>\n<p>Jesus calls himself &quot;The Amen&quot; which means valid and truthful in Hebrew. Another title He calls himself is the &quot;Originator&quot; which in Greek is the Ruler and Originator of God’s Creation.</p>\n<p>Jeremiah talking about Jesus:</p>\n<blockquote>\n<p>Jer. 33:2-3</p>\n<p>&quot;The LORD who made the earth, the LORD who forms it to establish it, Yahweh is His name, says this: Call to Me and I will answer you and tell you great and incomprehensible things you do not know.</p>\n</blockquote>\n<p>Isaiah talking about Jesus:</p>\n<blockquote>\n<p>Is. 45:18</p>\n<p>For this is what the LORD says—God is the Creator of the heavens. He formed the earth and made it.  He established it; He did not create it to be empty, but formed it to be inhabited—&quot;I am Yahweh, and there is no other.</p>\n</blockquote>\n<p>According to Hebrews 11:3 our trust in God shapes our understanding of how we came to exist - what we see was not made out of things that are visible.  When we tell our friends that we believe everything that is visible was made by an invisible eternal God with invisible words and commands - they may think us strange.  This voice activated design we see today is actual evidence of things hoped for and the proof of what is not seen.</p>\n<p>The alternative is a dark belief in billions and billions of years of random chance accidently putting us here with no purpose and only an illusion of design.</p>\n<blockquote>\n<p>Psalm 19:1-4</p>\n<p>The heavens declare the glory of God, and the sky proclaims the work of His hands. Day after day they pour out speech; night after night they communicate knowledge. There is no speech; there are no words; their voice is not heard. Their message has gone out to all the earth, and their words to the ends of the world.</p>\n</blockquote>\n<p>Final Thought:</p>\n<p>Dear God we know you are the uncreated One (Father, Son, and Holy Spirit) who has no beginning and no end.  As created beings made in your image, help us to know what it means to walk in your creation and hear your spoken word today pour forth speech.  We know today there are competing voices that talk of random chance and natural selection so let your valid truth, the light of the World help our thinking to observe your splendor in creation and know your purpose and design.  Thank you Lord,  Amen</p>\n"},"title":"The Universe Created by the Word of God","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2016-11-16"}},"pageContext":{"id":"6dfb6ab5-d96f-57b2-bf40-df6a8ad28506"}}