{"data":{"contentfulSermon":{"title":"Thankful","date":"2015-11-22","audioUrl":"https://s3.amazonaws.com/podcast.lifestonechurch.net/2015-11-22.mp3","audioDuration":"00:50:14","sermonSeries":null,"speaker":[{"id":"348d9a91-8bc9-5d4d-a836-483fb7bc4ccf","name":"Ben Helton","photo":{"file":{"url":"//images.ctfassets.net/ujxurwjh56v6/5W1GVxCuPuGA8cEc4auAYM/f4dccbc7a9048ab8e169352e87e74167/ben.jpg"}}}],"mainScripture":null,"fields":{"notesFormatted":"<h3>A Question and an Observation</h3>\n<ul>\n<li><p>What does it take to use you &quot;<em>master</em>&quot; card?</p></li>\n<li><p><em>Obedience</em> always precedes God's blessings.</p></li>\n</ul>\n<h3>Gratitude: It's Way More Than an Attitude</h3>\n<ol>\n<li><p>It's a <em>decision</em> and an <em>action</em>.</p>\n<p>Luke 17:15</p>\n<p>Philippians 4:4-7</p>\n<p>Colossians 3:17</p></li>\n<li><p>It's an <em>act</em> of <em>humility</em>.</p>\n<p>Luke 17:16</p>\n<p>Deuteronomy 8:11-17</p></li>\n<li><p>It draws us <em>closer to God</em>.</p>\n<p>Luke 17:12, 16</p>\n<p>Psalm 100:4</p>\n<p>James 4:7-10</p>\n<p>Romans 1:21</p></li>\n<li><p>It's <em>God's Will</em>.</p>\n<p>1 Thessalonians 5:18</p>\n<p>Ephesians 5:19</p></li>\n</ol>\n<h2>LifeGroup Discussion Questions</h2>\n<ol>\n<li><p>Our thanksfulness may be the greatest indicator of who we really think is in charge. What is your reaction to this statement?</p></li>\n<li><p>What attitudes, actions, or character qualities would you use to identify someone as being a person of gratitude? How have you seen this ebb and flow in your life?</p></li>\n<li><p>We heard in this Sunday's teaching from Romans 1:21 that unwillingness to obey and express gratitude can take us down a road of destruction and separation from God. In contrast, what does Philippians 4:4-7 tell us is the result of thankfulness in the midst of dealing with challenging or difficult issues?</p>\n<p>Think of a recent difficult situation or trial in your life. How could you have specifically expressed thankfulness to God in the midst of your requests to Him?</p></li>\n<li><p>God has designed us so that we best operate from a perspective of thankfulness. Our foundation of thankfulness best flows from knowing and remembering the benefits we receive from God that can result in our thankfulness.</p>\n<p>Which two or three would be most important for you to remember to help keep thankfulness in perspective?</p></li>\n<li><p>Our study showed us thankfulness is an act of humility. How could thankfulness help you move toward God as seen in James 4:6-10?</p></li>\n<li><p>Most of what we focused on this week was saying thanks to God. But there are many people in our lives that have done great things to get us where we are today. Is there anyone you need to get in touch with just to say thanks?</p></li>\n</ol>\n"}}},"pageContext":{"id":"eb882595-beae-5008-81ce-99b56066a4d4"}}