{"data":{"contentfulPost":{"id":"4e51254c-9d1b-5b2b-9d5b-fd7b98dd1971","fields":{"bodyFormatted":"<h3>Salvation in the Old Testament (Part 3 - The prophecy)</h3>\n<p>The Song of Moses is a song of prophecy before the event:</p>\n<blockquote>\n<p>Deut. 31:19</p>\n<p>&quot;Now therefore write this song and teach it to the people of Israel. Put it in their mouths, that this song may be a witness for me against the people of Israel. 20 For when I have brought them into the land flowing with milk and honey, which I swore to give to their fathers, and they have eaten and are full and grown fat, they will turn to other gods and serve them, and despise me and break my covenant.</p>\n</blockquote>\n<p>The song they were required to learn was about their lack of faithfulness and ability to despise God, and break their agreement with Him. In the song, &quot;Amazing Grace&quot; we sing the line &quot;saved a wretch like me&quot; and what made the Israelites despicable (wretched) is what makes us wretched . . . our sin and our ability to despise God.</p>\n<p>Jeremiah is a Prophet after the law breakers who despise God follow through with Moses' prophecy - this is what God says about His covenant breaking people:</p>\n<blockquote>\n<p>Jeremiah 2:13</p>\n<p>for my people have committed two evils: they have forsaken me, the fountain of living waters, and hewed out cisterns for themselves, broken cisterns that can hold no water.</p>\n</blockquote>\n<p>Jeremiah 17:5 goes onto to explain you are &quot;cursed&quot; if you trust in your own strength instead of depending on the LORD - he is like a shrub in the desert and desolate &quot;salt land&quot; vs the Jer. 17:7-8 person who trusts in the LORD and he is compared to a tree planted by God next to a stream that bears much fruit.</p>\n<blockquote>\n<p>Jeremiah 17:9</p>\n<p>The heart is deceitful above all things, and desperately sick; who can understand it? 10 &quot;I the LORD search the heart and test the mind, to give every man according to his ways, according to the fruit of his deeds.&quot;</p>\n</blockquote>\n<p>What is the heart of man that is deceitful and sick? The heart is your inner man - your thoughts, feeling and attitude - your ability and inability to tell the truth based on how you feel and your emotions.</p>\n<p>Can trust in God be based on how you feel?</p>\n<p>&quot;I know in my heart of heart this is true,&quot; is a statement that has to be met with your heart is sick and deceitful. Feelings end up being one of the worse ways to determine truth, it will not result in worship but in worship of your own ideas or what Jeremiah calls relying on your own strength.</p>\n<p>Jesus teaches: But if your eye is bad, your whole body will be full of darkness. So if the light within you is darkness—how deep is that darkness! (Matthew 6:23)</p>\n<p>The basis of biblical trust and the ability to know God's will all depend on God speaking and telling us plainly who He is (trustworthy, full of mercy, holy) and who we are (despicable and in need of His forgiveness). God also has the ability to call us holy because He gives that to us as a gift when we call on the name of the Lord for our forgiveness and trust that Jesus' sacrifice of his broken body and shed blood cover (atonement) and remove our sin from us which sets us free from the slavery of sin (redemption) and we acknowledge Jesus is risen and has called us to a new heart and life that lives for His glory instead of our glory.</p>\n<blockquote>\n<p>Romans 10:1</p>\n<p>1 Brothers, my heart's desire and prayer to God for them [chosen Israel] is that they may be saved. 2 For I bear them witness that they have a zeal for God, but not according to knowledge. 3 For, being ignorant of the righteousness of God, and seeking to establish their own, they did not submit to God's righteousness. 4 For Christ is the end of the law for righteousness to everyone who believes.</p>\n</blockquote>\n<p>Paul was praying for these good intentioned Jewish people who had a passion/zeal for God but it was not based on knowledge. They had been deceived into thinking they were serving God but at the end of the day when they tried to &quot;establish their own&quot; righteousness they were actually ignorant of &quot;the righteousness of God&quot; which is found in the person and work of Jesus Christ.</p>\n<p>Why does God put into plan a man and woman in a perfect garden knowing they will disobey Him?</p>\n<p>Why does God make a nation that will turn their back on him?</p>\n<p>Why does God extend a hand to a person drowning in their sin?</p>\n<p>God knows the end from the beginning (Isaiah 46:10) and his will is that all men be saved (2 Pet. 3:9 &amp; 1 Tim. 2:4) yet they are not all saved . . . this does not show God's weakness nor does it show his lack of control - the only way you can have God in control with free will men wanting to reject the Shepherd is to have a Good Shepherd who calls the sheep that are His own while all men are culpable (guilty) and deserving of not having a Shepherd at all - only those who listen (John 10:16) or as Jesus says it &quot;I know my own and my own know me.&quot; John 10:14</p>\n<p>To hear Jesus is totally different from hearing men . . . the heart is different, the message is different, the outcome is different as the Holy Spirit convicts us of our sin and shows us what is freely given in Christ . . . &quot;behold all things are made new&quot; (2 Cor. 5:17).</p>\n<p>Matthew 11:29 Take my yoke upon you, and learn from me, for I am gentle and lowly in heart, and you will find rest for your souls. 30 For my yoke is easy, and my burden is light.&quot;</p>\n<h3>Salvation in the Old Testament - (Part 4 - Calling on the name of the LORD)</h3>\n<blockquote>\n<p>Joel 2:32</p>\n<p>And it shall come to pass that everyone who calls on the name of the LORD shall be saved.</p>\n</blockquote>\n<p>Saved means to be delivered from sin and the consequence of sin is eternal separation from God. From what we know in Scripture we were made to know and walk with God (made in God's image). We were designed for that relationship to know and seek God.</p>\n<p>If you acknowledge you are drowning in your sin and you have no hope apart from God you are actually in a good place because you can begin to ask, seek, and knock - God is ready to answer.</p>\n<blockquote>\n<p>Romans 10:9</p>\n<p>because, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.</p>\n</blockquote>\n<blockquote>\n<p>Romans 10:13</p>\n<p>For &quot;everyone who calls on the name of the Lord will be saved.&quot; This is a quote from Joel 2:32 &quot;everyone one who calls on the name of the Yahweh shall be saved&quot;</p>\n</blockquote>\n<p>We are acknowledging that Jesus is Rev. 21:13 I am the Alpha and the Omega, the first and the last, the beginning and the end.&quot;</p>\n<blockquote>\n<p>Isaiah 44:6</p>\n<p>Thus says the LORD, the King of Israel and his Redeemer, the LORD of hosts: &quot;I am the first and I am the last; besides me there is no god.</p>\n</blockquote>\n<p>The confession is Jesus is the Author of Life (Acts 3:15, Heb. 12:1-2) the Alpha and Omega, the end of the law, the righteousness of God, the Yahweh who spoke it all into existence &quot;the Word was God&quot; and &quot;the Word became flesh and dwelt among us&quot;(Jn. 1:1&amp;14)&quot; and &quot;all things were made through him (Jn. 1:3)&quot; and &quot;by him all things were created, in heaven and on earth, visible and invisible (Col. 3:16) and we agree with Jesus that He is the Way and the Truth and the Life and no one can come to God the Father apart from Jesus the Good Shepherd (John 14:6).</p>\n<p>Anyone who says Jesus was created or not equal with God is basically saying he is not God (Alpha and Omega, Yahweh, Word become flesh) which according to Romans 10:9 is a necessary part of the confession Jesus is Lord!</p>\n<p>Another necessary part of the confession that David makes is the &quot;LORD is my Shepherd&quot; He makes me lie down . . . He restores my soul . . . He leads me in paths of righteousness . . .his rod and staff comfort . . . surely goodness and mercy shall follow [Hebrew: radaf - hunt you down] and I shall dwell in the house of the LORD forever.\nDavid could only make a good list of the LORD's work with an eternal consequence of dwelling in his presence forever.</p>\n<p>Have you confessed Jesus is LORD! Have you had his goodness and love and mercy chase you down?</p>\n<blockquote>\n<p>Romans 5:8</p>\n<p>but God shows his love for us in that while we were still sinners, Christ died for us.</p>\n</blockquote>\n<blockquote>\n<p>Ephesians 2:13</p>\n<p>But now in Christ Jesus you who once were far off have been brought near by the blood of Christ.</p>\n</blockquote>\n<blockquote>\n<p>John 10:26-30</p>\n<p>but you do not believe because you are not among my sheep. My sheep hear my voice, and I know them, and they follow me. I give them eternal life, and they will never perish, and no one will snatch them out of my hand. My Father, who has given them to me, is greater than all, and no one is able to snatch them out of the Father's hand. I and the Father are one.&quot;</p>\n</blockquote>\n<p>Is your salvation secure in Jesus? &quot;No one will snatch them out of my hand&quot;</p>\n<p>Can you do things to lose your salvation? Whatever list you come up with will be the same list of things to do to get salvation and would make you &quot;ignorant of the righteousness of God&quot; to borrow the language of Paul in Romans 10.</p>\n<p>Calling on the name of the Lord is a gentle and lowly heart calling for help.</p>\n<p>Calling on the name of the Lord is asking for Jesus' easy yoke and light burden.</p>\n<p>Calling on the name of the Lord is a call for forgiveness over my sin.</p>\n<p>Calling on the name of the Lord is acknowledging everything I need is found in Jesus.</p>\n<p>There is no step 2 or 3 there is only one step, one way, one means to become holy and righteous. To surrender and trust in God takes a sinful dead man in his sin and makes him alive and free from that sin, when we call on the name of the Lord for salvation.</p>\n<blockquote>\n<p>John 5:24</p>\n<p>&quot;I assure you: Anyone who hears My word and believes Him who sent Me has eternal life and will not come under judgment but has passed from death to life.</p>\n</blockquote>\n<p>In your testimony right now could you say for sure you have passed from death to life and you are secure in Jesus the Good Shepherd's hand for all eternity?</p>\n<p>If not follow the Old Testament plea to &quot;call on the name of the Lord!&quot;</p>\n<blockquote>\n<p>Acts 4:12</p>\n<p>There is salvation in no one else, for there is no other name under heaven given to people, and we must be saved by it.</p>\n</blockquote>\n"},"title":"Salvation in the Old Testament - Parts 3 & 4 \t","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2017-01-18"}},"pageContext":{"id":"4e51254c-9d1b-5b2b-9d5b-fd7b98dd1971"}}