{"data":{"contentfulPost":{"id":"3602bf69-2d9f-55d1-9016-99599df2320b","fields":{"bodyFormatted":"<p>As Lifestone Church enters an eight week emphasis on mercy and a six week study in our Life Groups about the miracle of mercy we have decided to set aside a day of prayer and fasting this Good Friday.</p>\n<p>The theology of fasting is simple. It is not commanded in the New Testament. In the Old Testament we are told of only one day of self-denial (fasting) set aside on the day of Atonement (<a href=\"https://www.bible.com/bible/72/LEV.23.26-32.hcsb\" target=\"_blank\">Leviticus 23:26-32</a>).</p>\n<p>Fasting is a voluntary effort to draw close to God and look for His direction and help.</p>\n<ul>\n<li>David fasted for the health of his son in <a href=\"https://www.bible.com/bible/72/2SA.12.16-17.hcsb\" target=\"_blank\">2 Samuel 12:16-17</a>.</li>\n<li>Nehemiah cried out in prayer and fasting when he heard the condition of Jerusalem being in shambles (<a href=\"https://www.bible.com/bible/72/NEH.1.hcsb\" target=\"_blank\">Nehemiah 1</a>).</li>\n<li>Ezra could have requested a king's cavalry and guard to get them back to Jerusalem, instead they prayed and fasted specifically for God's protection in travel (<a href=\"https://www.bible.com/bible/72/EZR.8.21-23.hcsb\" target=\"_blank\">Ezra 8:21-23</a>).</li>\n</ul>\n<h2>Fasting can be a community event.</h2>\n<p>Esther calls the Jews in her area to fast three days (no food or drink) before she dangerously approaches her husband and king (<a href=\"https://www.bible.com/bible/72/EST.4.15-17.hcsb\" target=\"_blank\">Esther 4:15-17</a>). The church in Antioch were praying and fasting when the Holy Spirit said, &quot;Set apart for me Barnabas and Saul for the work I have called them to.&quot;</p>\n<p>Fasting can be a full fast (no food or water - Esther's fast ) or a partial fast (get rid of certain things). Daniel for three weeks got rid of meats, wine, and skin lotion. (<a href=\"https://www.bible.com/bible/72/DAN.10.2-3.hcsb\" target=\"_blank\">Daniel 10:2-3</a>). If the skin lotion was some form of deodorant back then, we urge caution at this point. Jesus is against using fasting as an opportunity to show others your godliness in Matthew 6:16-18 and one of the ways people did this was to make themselves appear &quot;sad-faced&quot; and &quot;unattractive.&quot; Jesus tells us we are salt and light in <a href=\"https://www.bible.com/bible/72/MAT.5.13-16.hcsb\" target=\"_blank\">Matthew 5:13-16</a> and unlike fasting our &quot;good works&quot; (how we treat people) is light we are to &quot;shine before men.&quot;</p>\n<p>Fasting can be done for different reasons but you should know why you are fasting - it should be intentional. An example of a fasting prayer is recorded in Daniel 9 - it involves acknowledging God's power and &quot;abundant compassion&quot; and a confession of personal sin and community sin (<a href=\"https://www.bible.com/bible/72/DAN.9.20.hcsb\" target=\"_blank\">Daniel 9:20</a>) because His people did not listen to God and obey what He commanded.</p>\n<p>Fasting, like tithing and even prayer can be done for the wrong reason, which is usually self-promotion: this does not mean we should avoid fasting, or prayer, or tithing. &quot;I fast twice a week; I give a tenth, of everything I get.' - <a href=\"https://www.bible.com/bible/72/LUK.18.12.hcsb\" target=\"_blank\">Luke 18:12</a> This is a Pharisee standing and announcing his prayer that he was righteous and reminded God why: fasting and tithing. God was more impressed with the humble sinner's prayer: &quot;God be merciful to me, the sinner&quot; (<a href=\"https://www.bible.com/bible/72/LUK.18.13.hcsb\" target=\"_blank\">Luke 18:13</a>). Jesus said of the two prayers the humble sinner went home &quot;justified&quot; (declared righteous by God) while the self-righteous prayer was mere self-exultation.</p>\n<p><strong>The Focus of our Day of Prayer</strong>: Hear us because of Your abundant Mercy/Compassion</p>\n<blockquote>\n<p>Daniel 9:18</p>\n<p>Listen, my God, and hear. Open Your eyes and see our desolations and the city called by Your name. For we are not presenting our petitions before You based on our righteous acts, but based on Your abundant compassion.</p>\n</blockquote>\n<h2>Confession of our Sin</h2>\n<blockquote>\n<p>Nehemiah 1:5-6</p>\n<p>I said, Yahweh, the God of heaven, the great and awe-inspiring God who keeps His gracious covenant with those who love Him and keep His commands, let Your eyes be open and Your ears be attentive to hear Your servant's prayer that I now pray to You day and night for Your servants, the Israelites. I confess the sins we have committed against You. Both I and my father's house have sinned.</p>\n</blockquote>\n<blockquote>\n<p>Daniel 9:5</p>\n<p>we have sinned, done wrong, acted wickedly, rebelled, and turned away from Your commands and ordinances.</p>\n</blockquote>\n<p>Pray that God begins to break up the hard ground of the South Valley (Herriman, Riverton, South Jordan, Draper, Sandy, Bluffdale, Lehi... in Utah and Salt Lake County).</p>\n<blockquote>\n<p>Hosea 10:12</p>\n<p>Sow righteousness for yourselves and reap faithful love; break up your unplowed ground. It is time to seek the LORD until He comes and sends righteousness on you like the rain.</p>\n</blockquote>\n<p>Prepare our community to have a soft and receiving heart for the gospel. - <a href=\"https://www.bible.com/bible/72/HOS.10.12.hcsb\" target=\"_blank\">Hosea 10:12</a></p>\n<p>The writer of Hebrews reminds us in <a href=\"https://www.bible.com/bible/72/HEB.10.19-23.hcsb\" target=\"_blank\">Hebrews 10:19-23</a> that we have boldness to go into God's presence by the blood of Christ and his flesh, which is a new and living way that gives us a holiness of &quot;hearts sprinkled clean from an evil conscience&quot; and our &quot;bodies washed in pure water&quot; - the following prayer from this new and living way is for genuine concern for each other, a promotion of love, good works, and coming together to worship, and encourage each other, because some started to have the habit of &quot;staying away.&quot;</p>\n<blockquote>\n<p>Hebrews 10:24-25</p>\n<p>And let us be concerned about one another in order to promote love and good works, not staying away from our worship meetings, as some habitually do, but encouraging each other, and all the more as you see the day drawing near.</p>\n</blockquote>\n<p>Our intention of this prayer is to promote God's mercy and that we all become people of action (<a href=\"https://www.bible.com/bible/72/JHN.3.18.hcsb\" target=\"_blank\">1 John 3:18</a>) motivated by God's love and mercy (<a href=\"https://www.bible.com/bible/72/2CO.4.1.hcsb\" target=\"_blank\">2 Corinthians 4:1</a>).</p>\n<p>Please join us this day for prayer over our community - if you choose to fast or choose to have simple conversations with God throughout the day, God is pleased to have our will conform to His will (purpose of prayer).</p>\n"},"title":"A Day of Prayer for Lifestone Church","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2017-04-12"}},"pageContext":{"id":"3602bf69-2d9f-55d1-9016-99599df2320b"}}