{"data":{"contentfulPost":{"id":"484e821d-9f54-506e-92fe-d5094d259961","fields":{"bodyFormatted":"<p>Do we see Jesus as the source/author and perfector/finisher of our faith?</p>\n<p>If we add to Jesus' teaching or take away from His teaching He is not going to be our author and finisher but just a step along the way or a part of the puzzle that leaves the rest of salvation to our inability.</p>\n<p>Hebrews 12:2 keeping our eyes on Jesus, the source and perfecter of our faith, who for the joy that lay before Him endured a cross and despised the shamed and has sat down at the right hand of God's throne.</p>\n<p>This study looks at 5 more teachings of Jesus that many religious people (who claim to be within Christianity) disagree with.</p>\n<h2>#6 Marriage in heaven? -What did Jesus teach</h2>\n<blockquote>\n<p>Matthew 22:30</p>\n<p>For in the resurrection they neither marry nor are given in marriage, but are like angels in heaven.</p>\n</blockquote>\n<p>This was to answer the question whom's wife will she be in heaven, the she was a woman who married a man who then died, and married another man who died, and another till she died with 7 husbands awaiting her in heaven or &quot;in the resurrection&quot;. Who then will be her heavenly husband? Jesus teaches &quot;they neither marry nor are given in marriage&quot; - angels don't have partners in heaven we will not have partners in heaven. The irony in this question is that it was being asked by the Sadducees who do not believe in resurrection which means they did not believe in the power and accuracy of God's Word.</p>\n<blockquote>\n<p>Matthew 22:29</p>\n<p>But Jesus answered them, &quot;You are wrong, because you know neither the Scriptures nor the power of God.</p>\n</blockquote>\n<p>In Luke 16 we have a rich man and a poor man, one dies and goes to Abraham's side and the other dies and goes to &quot;Hades&quot;. The rich man in hell is convinced if a dead man were to rise from the grave and go convince his 5 brothers that this &quot;place of torment&quot; is real they will repent.\nAt which Jesus telling the story gives Abraham's reply:</p>\n<blockquote>\n<p>Luke 16:29-31</p>\n<p>But Abraham said, ‘They have Moses and the Prophets; let them hear them.'\nAnd he said, ‘No, father Abraham, but if someone goes to them from the dead, they will repent.'\nHe said to him, ‘If they do not hear Moses and the Prophets, neither will they be convinced if someone should rise from the dead.'&quot;</p>\n</blockquote>\n<p>Jesus is again teaching the power of God's Word (the Old Testament) - it is more powerful than resurrected men knocking on doors - Wow!</p>\n<p>So why do people need a modern day prophet - a prophet for today, to teach them the exact opposite of what Jesus taught? A prophet to undo what Jesus proclaimed or explain with greater detail or what Paul called &quot;go beyond what is written&quot; (1 Cor. 4:6). Paul in Acts 20 is meeting with the Ephesus elders and warns them, when he departs that &quot;fierce wolves&quot; were coming and will arise among themselves to speak &quot;twisted things&quot; - their goal is to have disciples follow them (Acts 20:30). Jesus explanation of false prophets was:</p>\n<blockquote>\n<p>John 7:18</p>\n<p>The one who speaks on his own authority seeks his own glory; but the one who seeks the glory of him who sent him is true, and in him there is no falsehood.</p>\n</blockquote>\n<p>If you believe and teach marriage in heaven when Jesus clearly teaches &quot;they neither marry nor are given in marriage&quot; at what point do you call Jesus Lord? Are you bothered at disagreeing with Jesus?</p>\n<h2>#7 Do you need another prophet besides Jesus?</h2>\n<p>The Prophecy given to Moses comes with a warning to those who do not listen:</p>\n<blockquote>\n<p>Deuteronomy 18:18-19</p>\n<p>I will raise up for them a prophet like you from among their brothers. And I will put my words in his mouth, and he shall speak to them all that I command him. And whoever will not listen to my words that he shall speak in my name, I myself will require it of him.</p>\n</blockquote>\n<p>The testimony of Jesus is the spirit of prophecy (Rev. 19:10) all true prophets before Jesus attest to the testimony of Jesus. If Jesus is your king and priest he is also your &quot;faithful witness&quot; (Rev. 1:5) which is the role of a prophet - you need no other king, you need no other priest, and you definitely need no other prophet. Moses was told a prophet will arise and that &quot;I will put my words in his mouth&quot; (Deut. 18:18) and &quot;he shall speak to them all what I command him.&quot; Does Jesus teach his words come from God the Father? - Let's see:</p>\n<blockquote>\n<p>John 7:16-17</p>\n<p>So Jesus answered them, &quot;My teaching is not mine, but his who sent me. If anyone's will is to do God's will, he will know whether the teaching is from God or whether I am speaking on my own authority.</p>\n</blockquote>\n<blockquote>\n<p>John 8:26</p>\n<p>I have much to say about you and much to judge, but he who sent me is true, and I declare to the world what I have heard from him.&quot;</p>\n</blockquote>\n<blockquote>\n<p>John 14:10</p>\n<p>Do you not believe that I am in the Father and the Father is in me? The words that I say to you I do not speak on my own authority, but the Father who dwells in me does his works.</p>\n</blockquote>\n<blockquote>\n<p>John 14:24</p>\n<p>Whoever does not love me does not keep my words. And the word that you hear is not mine but the Father's who sent me.</p>\n</blockquote>\n<p>It is a very consistent and clear teaching - Jesus does not speak his own words, but the Father who sent him. Jesus is the faithful witness of Revelation 1:5 and the Prophet of Deuteronomy 18:18 - if we change his teaching or do not do what he says it will be required of us. As the crowds starting shouting: &quot;Hosanna to the Son of David! Blessed is he who comes in the name of the Lord! Hosanna in the highest!&quot; (Matthew 21:9) people asked who this person was - the answer: &quot;This is the prophet Jesus&quot;</p>\n<blockquote>\n<p>John 17:8</p>\n<p>For I have given them the words that you gave me, and they have received them and have come to know in truth that I came from you; and they have believed that you sent me.</p>\n</blockquote>\n<p>The New Testament explains we don't need another prophet because Jesus is the end of the Law (Romans 10:4) Jesus explains his suffering is mentioned throughout the Old Testament (Luke 24:27) and in a hometown sermon he reads Isaiah 61:1-2 and tells his home town folks that today in their hearing this prophecy is fulfilled (Luke 4:21) and then proceeds to tell them &quot;no prophet is acceptable in his hometown&quot; (Luke 4:24) just before they try to run him off a cliff and kill him.</p>\n<p>Is there a prophet greater than Jesus? A prophet that is God himself (2 Pet. 2:1), a prophet who empties Himself of His unique heavenly position (Phil. 2:6-7), a prophet who lived a sinless life (Heb. 4:15), a prophet who comes to seek and save the lost (Luke 19:10), a prophet that comes to fulfil the law but not abolish or rewrite the law to suit his own needs (Matt 5:17-18), a prophet who &quot;bore our sin&quot; (1 Pet. 2:24) and a prophet that one day, every knee will bow and every tongue confess He is Lord (Phil.2:11).</p>\n<blockquote>\n<p>Romans 3:21-22</p>\n<p>But now, apart from the law, God's righteousness has been revealed—attested by the Law and the Prophets, —that is, God's righteousness through faith in Jesus Christ, to all who believe, since there is no distinction.</p>\n</blockquote>\n<h2>#8 No one can come to Me unless the Father who sent Me draws him (John 6:44)</h2>\n<h2>#9 Anyone who eats my flesh and drinks my blood has eternal life (John 6:54)</h2>\n<p>This saying from Jesus in John 6:54 has become controversial because people take it literally, maybe because Jesus said, &quot;my flesh is true/real food, and my blood is true/real drink&quot; in John 6:55. The context of the teaching comes from Jesus teaching that people ate manna in the Old Testament and died but if people eat this bread from heaven as Jesus said, &quot;I am the bread of life&quot; John 6:35 &quot;whoever comes to me shall not hunger, and whoever believes in me shall never thirst.&quot; The invitation Jesus is giving is to come and believe. The main thrust of the teaching in John 6 is this bread from heaven came to give life and if you just look at it and walk away you will not be eating and drinking the blood but if you &quot;believe&quot; or &quot;eat&quot; you are going to have eternal life.</p>\n<blockquote>\n<p>John 6:29</p>\n<p>This is the work of God, that you believe in him whom he has sent</p>\n</blockquote>\n<blockquote>\n<p>John 6:40</p>\n<p>...that everyone who looks on the Son and believes in him should have eternal life</p>\n</blockquote>\n<blockquote>\n<p>John 6:47</p>\n<p>Truly, truly, I say to you, whoever believes has eternal life.</p>\n</blockquote>\n<blockquote>\n<p>John 6:51</p>\n<p>...If anyone eats of this bread, he will live forever.</p>\n</blockquote>\n<p>The context here is not the Lord's Supper or Eucharist or turning the Old Testament Passover meal into a new covenant which Jesus does in Matt. 26, Mark 14, and Luke 22. When the Apostle John turns to that celebration in John 13-17 the bread and wine are not even mentioned. The Holy Spirit who &quot;gives life&quot; is.</p>\n<p>Jesus ends his &quot;you must eat of my flesh and drink of my blood&quot; message with:</p>\n<blockquote>\n<p>John 6:63-65</p>\n<p>It is the Spirit who gives life; the flesh is no help at all. The words that I have spoken to you are spirit and life. But there are some of you who do not believe.&quot; (For Jesus knew from the beginning who those were who did not believe, and who it was who would betray him.) And he said, &quot;This is why I told you that no one can come to me unless it is granted him by the Father.&quot;</p>\n</blockquote>\n<p>Some people have made the Lord's Supper the place where the gift is given or dispensed - Jesus taught the gift in John 6 which is the bread of life is given by the Father (v. 32) and the Son (v. 27) and the gift of life is given by who? The Holy Spirit (v. 63) and the words that Jesus just taught are spirit and life. Nowhere in John 6 does Jesus say in the future when we eat the Passover Meal and drink wine you will actually be eating real Jesus flesh and drinking real Jesus blood, that is something religious people bring to the text. When you partake of Jesus in John 6 the Father gives the bread of life who is Jesus and the Holy Spirit gives the eternal life - at the Lord's Supper we are taking the bread which is the body of Christ and the wine which is the blood of Christ but it is done in &quot;remembrance&quot; (Luke 22:19 7 1 Cor. 11:24-25) not the actual event.</p>\n<blockquote>\n<p>John 14:26</p>\n<p>But the Helper, the Holy Spirit, whom the Father will send in my name, he will teach you all things and bring to your remembrance all that I have said to you.</p>\n</blockquote>\n<p>The truth is we do participate in the death of Christ - it becomes a part of our identity, but we don't participate in the death by eating Jesus' skin and we don't participate literally in drinking Jesus' blood. This is the same allegory as picking up your cross daily and following him (Luke 9:23), letting the kernel of wheat die in the ground to produce a new thing (John 12), eating and drinking Christ is saying not as I will but as you will (John 6:38) and following Christ in that example. When we do &quot;take, eat, this is my body&quot; (Matt. 26:26) Jesus is standing before them, they are not eating Jesus skin but taking an Old Testament tradition of Passover bread (symbol of freedom and quickly being released from slavery) and understanding it in a new covenant framework. which the Holy Spirit will teach them &quot;all things and bring to your remembrance all that I have said to you.&quot;</p>\n<p>Jesus does not teach real presence in the elements of bread and wine in John 14-16 but real presence in the Holy Spirit - we are Romans 8 Christians no longer under the sentence of sin (condemnation) but free in the Holy Spirit.</p>\n<h2>#10 How are you to escape from being sentenced to hell?</h2>\n<p>The &quot;you&quot; here is probably a bunch of wild prostitutes and deceitful tax collectors but as it turns out Jesus actually teaches they (repentant prostitutes and tax collectors) are entering the kingdom before these people (Matt. 21:31). Jesus here in Matthew 23:33 is talking to the most religious people of the his day, the Pharisees who &quot;shut the kingdom of heaven in people's faces&quot; (Matt. 23:13) and when they do have a convert they make them &quot;twice as much a child of hell as yourselves&quot;(Matt. 23:15). The religious scribes and Pharisees were people who had proud testimonies of their faithful deeds in serving God with tithe, acts performed publicly, and persistent study of God's Word but in the end that Word of God which should have brought them broken over their own sin and led them to the cross of Christ (Gal. 3:24) was used to bolster a false religion of self promotion.</p>\n<blockquote>\n<p>Romans 10:3-4</p>\n<p>For, being ignorant of the righteousness of God, and seeking to establish their own, they did not submit to God's righteousness. For Christ is the end of the law for righteousness to everyone who believes.</p>\n</blockquote>\n<p>If Jesus is saying this to a bunch of religious people what is he saying to us?\nWhat are you trusting in to make you right with God?</p>\n<p>If you were to stand before God today and He were to ask, &quot;Why should I let you into heaven?&quot; What would you say? If the answer is something other than complete dependent trust in Christ . . . you are &quot;ignorant of the righteousness of God.&quot; They did their good deeds with &quot;zeal&quot; and &quot;passion&quot; according to Romans 10:2 but the problem with religious people is the problem with all of us - &quot;our righteous acts are like filthy rags&quot; (Isaiah 64:6) and on judgment day God examines the motives and &quot;intentions&quot; of the heart (1 Cor. 4:5) and anything not motivated by the love God has for us in Christ will be a shriveled up leaf blown away (Isaiah 64:6).</p>\n<p>Jesus main thrust in teaching hell, was repentance now - you can even hear that tone in Matthew 23 as he is telling these religious people they are hell bound. He is wanting them to get the inside of the cup clean but they are focussed on the outside appearance of righteousness and in the end Jesus cries out</p>\n<blockquote>\n<p>Matthew 23:37</p>\n<p>&quot;O Jerusalem, Jerusalem, the city that kills the prophets and stones those who are sent to it! How often would I have gathered your children together as a hen gathers her brood under her wings, and you were not willing!</p>\n</blockquote>\n<p>The severity of hell is eternal separation from God, the Bible teaches no second chances on the other side of the grave but it does teach the dead are brought up and judged according to their works in Revelation 20:13, then they were thrown into the lake of fire (Rev. 20:14).</p>\n<p>This upsets people who proclaim love wins and ultimately all will eventually go to heaven. When we teach hell changes hearts instead of the love of God in the gospel then we end up with two different gospels - one that forces people for all eternity to want God vs. one through grace right now changing me to glorify God for all eternity. My testimony is that I am not naturally a God lover - it is a consequence of sin, but even Satan in the perfect presence of God makes worship about his own splendor. Not only do I not love God but I like doing things my way and I reject His Potter work on my clay like substance. So how did God change my heart? I not only heard the Word of God, I agreed with the Word of God and let the Holy Spirit do His work of convicting me and leading me to righteousness in Christ and understanding that God's judgment (eternal hell) is justice for my sin and trespass.</p>\n<p>These Pharisees with their religious system were not about giving glory to God but about giving glory to themselves in their religious worship. There is a consequence for that, God gives you what you want - an eternal life focussed on self instead of God - it will be a forever torment &quot;where their worm does not die and the fire is not quenched.&quot; (Mark 9:48).</p>\n<p>People designed to delight in God and made to walk with God do not get to do what they were made to do because they do not want God or anything to do with His Word and Authority. The language in Romans 1 is that he gives these people over to their sin &quot;God delivered them over to a worthless mind&quot; (Romans 1:28) and then there is a list of over 15 sins that are the fruit of life without God (God-haters, gossips, arrogant, disobedient to parents, proud, boastful, unloving, unmerciful . . .) and Paul ends with the thought &quot;they know full well God's just sentence&quot; which will be eternal hell and separation from God - this knowledge does not bring about turning away from sin and having one's mind changed (repentance).</p>\n<blockquote>\n<p>2 Timothy 4:3-4</p>\n<p>For the time will come when they will not tolerate sound doctrine, but according to their own desires, will multiply teachers for themselves because they have an itch to hear something new. They will turn away from hearing the truth and will turn aside to myths.</p>\n</blockquote>\n<p>One of the common teachings today is people will be given a second chance after death to say &quot;yes&quot; to God so that love will win. Not only does the Bible not teach this but the Bible teaches people who lived under a 1,000 year complete rule and reign of Christ - seeing Him in His glory will gather against Him in Revelation 20:6-10. Their number was &quot;like the sand of the sea&quot; and they gathered to go against Christ.</p>\n<blockquote>\n<p>Revelation 20:13-15</p>\n<p>Then the sea gave up its dead, and Death and Hades gave up their dead; all were judged according to their works. Death and Hades were thrown into the lake of fire. This is the second death, the lake of fire. And anyone not found written in the book of life was thrown into the lake of fire.</p>\n</blockquote>\n<p>The other amazing thing in Revelation 21 is a teaching of one city that has gates that are never shut and those who have access are the ones whose names are written in the Lamb's book of life (Rev. 21:27, 13:8) they are referred to as &quot;the bride, the wife of the Lamb&quot; (Rev. 21:9).</p>\n<blockquote>\n<p>Rev. 22:17</p>\n<p>Both the Spirit and the bride say, &quot;Come!&quot; Anyone who hears should say, &quot;Come!&quot; And the one who is thirsty should come. Whoever desires should take the living water as a gift.</p>\n</blockquote>\n<p>And then a warning is given not to add to the prophecy of this book (Rev. 21:18) or take away from the prophecy of this book (Rev. 21:18) or severe things will happen to them.</p>\n<p>When I teach there are many different levels of heaven when John only shows us one city, have I added to the prophecy of this book? When I teach people will not have a &quot;second death&quot; or thrown into the lake of fire because &quot;God's love wins&quot;, have I taken away from the prophecy of this book? The ministries and teachers are not few but are large corporations - they are many just like Jesus said they would be. Chances are if you turn on a Christian TV show or ministry right now you will not be hearing God's Word studied accurately in proper context but people who bring their own thoughts to the message who turn aside to myths and twist the Word of God. Jesus told us ahead of time these false teachers would be &quot;many&quot;, do you want to abide in His teaching? Do you want to get back to His Word and Way? - Come!</p>\n"},"title":"10 Teachings of Jesus That Many Religious People Disagree With - Part 2","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2017-03-15"}},"pageContext":{"id":"484e821d-9f54-506e-92fe-d5094d259961"}}