{"data":{"contentfulPost":{"id":"3304b98d-22f6-5b4d-a2dd-926caa86a9fb","fields":{"bodyFormatted":"<h2>What Jesus Taught About The Trinity</h2>\n<p>When I get into conversations with people who think the Trinity is unbiblical or comes from church creeds (Apostles creed or Nicene the most famous) I always take them to John 14 and 16. I teach the Trinity because Jesus taught the Trinity clearly and distinctly. John 14 - I am leaving you but not as orphans (Jn.14:3, 8) - the Father will send another to comfort you (Holy Spirit Jn. 14:26) when he comes the Father and the Son will be in you (Jn. 14:23). After Jesus teaches he will be with them no more in John 14 he gives them the command in John 15:4-5 to abide (remain) in Him.</p>\n<h3>How do you abide with someone who is no longer around?</h3>\n<p>Jesus taught in Matthew 24:23 that Christ will not in the future do guest appearances. According to Jesus' own teaching which is a part of the command in John 15 to abide - Jesus warned me ahead of time this would happen and I should not be surprised when people come up with convincing stories of Jesus visitations.</p>\n<p>When we do have people see Christ after the the ascension into heaven it is always visions and they keep Christ in heaven (Stephen as he is being stoned, Paul on road to Damascus, John in Revelation) proving this is a consistent biblical teaching. When my faith comes from a man who goes against this teaching - then my faith is not abiding in Christ, it is abiding in a new thing that is different from the biblical good news.</p>\n<p>I have been asked who is Jesus praying to in the garden if Jesus is the Father? Hank Hanegraaff, known as the Bible answer man says, at that many confuse <strong>the What of the Trinity</strong> (One Being, Essence, Substance) with <strong>the Who of the Trinity</strong> (Father, Son, and Holy Spirit). <strong>The What of God</strong> gets declared in Deut. 6 - hear O Israel the LORD <strong>your God is one</strong>! (One Substance - never created, eternal, and thus worthy of worship). I am constantly told in Isaiah there is only one God (Isa. 45:5) in Isaiah 42 he created all the &quot;heavens&quot; - stars, galaxies and Isa. 43:10-11 - <strong>there was no god before me nor will there be one after me</strong>. When my child comes and asks me who is God, my answer is - the One who was not created (Father, Son, and Holy Spirit).</p>\n<p>All three are worthy of worship simply because they are unique to all creation - they create and are not created.</p>\n<p>When I meet someone who claims God was once a man and is a created glorified being who has become &quot;heavenly Father&quot; then we begin to see the difference between a created god (not a Christian concept) vs. a eternal God with no beginning or end (Christian concept).\nAs soon as we introduce the concept of created God we have to ask the question: who created &quot;heavenly father&quot;?</p>\n<p>The Christian concept of God starts with a God who was never created:</p>\n<blockquote>\n<p>Isaiah 43:10</p>\n<p>&quot;You are my witnesses,&quot; declares the LORD, &quot;and my servant whom I have chosen, that you may know and believe me and understand that I am he. Before me no god was formed, nor shall there be any after me.</p>\n</blockquote>\n<p>In Isaiah 45-46 <strong>seven times God says He is LORD</strong> and &quot;<strong>there is no other</strong>&quot; he created the universe.</p>\n<p>Thanks to the Dead Sea Scrolls (DSS) we as Christians have something old to say about Isaiah. The DSS tell us the Bible has not been corrupted over time - pretty much what we had in 250 BC is what we have in 900 AD (date of oldest complete Masoretic Text) which is what we have in 2017+ AD - it has not changed or been corrupted or tampered with. If you can not get your new revelation to agree with the reliable Word of God and a God who does not by nature change over time, you naturally have to teach the Word of God has been corrupted or change the context of what is being taught in Isaiah. These are both current trends in many churches today.</p>\n<p>Getting back to the who is Jesus praying to question - In John 10:30 Jesus says, &quot;I and the Father are one&quot; Well if they are the same person then how can Jesus talk to the Father - would that not be like me talking to myself? - Again biblical context wins out - the &quot;one&quot; in Greek is neuter not referring to person but to purpose and essence - this corresponds well to John 14 &quot;whoever has seen me has seen the Father (Jn. 14:9) not because Jesus is the Father but because Jesus shows them the Father, the words he speaks are not his own, they belong to the Father (Consistent in John 5:19, 6:46, 8:38 &amp; 42). John 5:19 So Jesus said to them, &quot;Truly, truly, I say to you, the Son can do nothing of his own accord, but only what he sees the Father doing. For whatever the Father does, that the Son does likewise.</p>\n<p>Some of the names given to the child born in Isaiah 9:6 are: Wonderful Counselor, Mighty God, Everlasting Father, again this teaches the born Christ child is truly God - of the same Essence and Being as the Father.</p>\n<p>Nowhere does Jesus say the Father is the Son or Jesus is the Father.</p>\n<p>Is the Father in Jesus? Answered in John 14:10-11</p>\n<p>Is Jesus going to the Father? Answered in John 14:12, 17:11</p>\n<p>Is Jesus the Father? No - but the Father is &quot;in&quot; him and when He goes to the Father (who is not the Son or Holy Spirit because Jesus makes that clear), the Father will send the Holy Spirit.</p>\n<p>When the Holy Spirit comes he &quot;will be in&quot; you (referring to followers of Christ - Jn. 14:17). That is the exact same language Jesus used to teach Philip that: &quot;whoever has seen me has seen the Father&quot; he goes on to say &quot;I am in the Father and the Father is in me&quot; (v. 11) but before that he again makes the distinction that the words he speaks are not his &quot;own authority, but the Father who dwells in me does his works.&quot; (v. 10).</p>\n<p>Same God different manifestations does not fit with what Jesus teaches in any part of the Gospels. When we get to heaven will there be three different Gods we bow to - Father, Son, and Holy Spirit? Again Jesus does not teach three different God's - He actually teaches the Unity of the Godhead with &quot;we will come&quot; and &quot;we&quot; will make our home with those who &quot;keep my word&quot; (Jn. 14:21) who are the we? - Father, Son, and Holy Spirit. So yes all three will be present but only Jesus has the flesh and bone (Luke 24:39) the Father and the Spirit will be worshiped in truth and spirit (John 4). There is a current trend in Christianity to give the Father and the Spirit flesh and bone and the justification is so we can sit down and talk with them and find out they care very much about us, Paul was able to find out God the Father (no human eye has ever seen or will see&quot; 1 Tim. 6:16 because He lives in &quot;unapproachable light&quot;) and the Holy Spirit are very relatable and caring and want a relationship with Him. If making God visible brings about a better relationship with God then we would need to redefine what Jesus taught in John 14:6 and what Paul taught in 2 Cor. 5:7 we walk/live by _______ not by sight).</p>\n<p>When the Holy Spirit came at Pentecost they had the full power to abide in Jesus . . .&quot;But if Christ is in you&quot; (Rom. 8:10) for all who are led by the Spirit of God are sons of God (Rom. 8:14) by whom we cry, &quot;Abba! Father!&quot;(Gal. 4:6) - Even the Holy Spirit is teaching us the distinctions of the Godhead. They are not mere manifestations of the same person and to teach that runs counter to Christ's clear teaching of the person distinctions and unity of God as one - which Jesus did teach.</p>\n<blockquote>\n<p>John 6:46</p>\n<p>not that anyone has seen the Father except he who is from God; he has seen the Father.</p>\n</blockquote>\n<blockquote>\n<p>John 8:38</p>\n<p>I speak of what I have seen with my Father...&quot;</p>\n</blockquote>\n<blockquote>\n<p>John 8:42</p>\n<p>Jesus said to them, &quot;If God were your Father, you would love me, for I came from God and I am here. I came not of my own accord, but he sent me. Jesus is God but He is not the Father - he has an eternal and perfect relationship with this person of the Trinity.</p>\n</blockquote>\n<blockquote>\n<p>Mark 13:32</p>\n<p>&quot;But concerning that day or that hour, no one knows, not even the angels in heaven, nor the Son, but only the Father.</p>\n</blockquote>\n<p>The New Testament teaching is consistent in revealing the Trinity - One God in Three persons. When I look at Jesus I get to see the non-visible Father because He represents Him so well in word, deed, purpose and essence (Being). Jesus miracles are performed in the Power of the Holy Spirit (Matt. 12) and His teaching is done through the Holy Spirit in Col. 2:9 so that we have Christ portrayed as &quot;the whole fullness of deity dwells bodily.&quot;</p>\n<p>The Trinity is best taught as Jesus taught it - Father, Son, Holy Spirit as distinct persons yet all fully representing each other because they are of the same Essence or Being one. Even later on the Holy Spirit in Rom. 8 is referred to the Spirit of Christ, Philippians 1:19 the &quot;Spirit of Jesus Christ&quot; and in Romans 8:9 if you don't have the Holy Spirit you don't have Christ. This is consistent with what Jesus taught in John 14-16. The reason the Trinity is attached to the gospel is tied to many passages - 2 Peter 1:8 warns us to grow and not be &quot;ineffective and unfruitful in the knowledge of our Lord Jesus Christ&quot; - who Christ is becomes crucial to salvation - 2 Pet. 1:11 For in this way there will be richly provided for you an entrance into the eternal kingdom of our Lord and Savior Jesus Christ.</p>\n<p>John 14:6 Jesus said to him, &quot;I am the way, and the truth, and the life. No one comes to the Father except through me. 7 If you had known me, you would have known my Father also. From now on you do know him and have seen him.&quot; -Quite a statement since John 1 teaches no one has seen the Father except the Son - John 1 also teaches the Word who became flesh (Jesus) created everything (John 1:3) and Col. 1:16 even indicates he created invisible angelic beings (heavenly authorities) so Satan is not a brother but a creation of Jesus. The classical way of presenting how the Father, Son, and Holy Spirit work is the Father has a plan or blueprint - the Son speaks it into existence and the Spirit sees it to completion. This is the way God has worked in creation and this is also the way God works in salvation (Eph. 1). Although the Trinity is alluded to in the Old Testament - Gen. 1 let us make man in &quot;our&quot; image it is most clearly taught by Jesus in the gospel of John during the Lord's Supper (John 13-17).</p>\n<p>Remember if I don't abide in the teaching of Christ Jesus teaches: John 15:6 If anyone does not abide in me he is thrown away like a branch and withers; and the branches are gathered, thrown into the fire, and burned. If you don't believe in the Trinity it is worth investigating - I hope as followers of Christ we would want to know what he taught about it to develop our thinking and guide our teaching. If you believe Christ is created you are not trinitarian, if you believe god is three separate beings you are not trinitarian, if you believe that God is only one (Jehovah) showing up in two other modes (modalism) you are not trinitarian. At the end of the day we know according to Matthew 7 that many did miracles and prophecy and other wonderful things in the name of Jesus and he simply says to them - depart from me, you workers of lawlessness - those are people who hear his teaching and even agree with it but do not do it.</p>\n<p>Objections to the Trinity and some examples you want to avoid:</p>\n<p>The word is not in the Bible - correct. It is a concept of understanding God in the way He has revealed Himself. Many theologians would argue we know it comes from an eternal, complex God because it would be much easier to teach something humans could more easily relate to.</p>\n<p>Examples and Analogies to avoid:</p>\n<p>One God showing up in 3 modes (modalism): These examples are good at communicating one substance but bad at communicating each is different from the other (persons)</p>\n<p>3 braids of hair, a clover leaf, states of water (steam, water, ice), 3 in 1 shampoo</p>\n<p>the man: who is an uncle, son, and father</p>\n<p>3 Different Gods (tritheism)</p>\n<p>An Egg (yolk, white, and shell) 3 distinct parts but is the yolk the same substance as the shell? This is where the analogy breaks apart.</p>\n<p>Sun, Light, and Heat (this could be modalism as well)</p>\n<p>Man is body, soul, and spirit (like the clover leaf it can teach modalism or tritheism)</p>\n<p>3 separate robots coming together to make one really cool destructive robot (transformers)</p>\n<p>In the trinity each member is a distinct person who is able to relate with the other member of the Godhead, they are not the same person and they have a perfect relationship with no hierarchy or subordination, none is more God than the other.</p>\n<p>If we have no easy model or good demonstration point to teach kids and family members what should we teach?</p>\n<p>Teach what Jesus taught and make sure you understand the words Being and Person.</p>\n<p>Substance/Essence/Nature/<strong>Being</strong> (100% God) - the <strong>what</strong> of God (One, eternal, equal in power, love, mercy, holiness, and other attributes of God)</p>\n<p><strong>Personhood</strong>: will, distinction, not the same person, &quot;I&quot; vs. you (statements heard spoken by each person to the other persons of the Trinity) - the <strong>who</strong> of the Trinity</p>\n"},"title":"The Trinity Explained","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2016-12-28"}},"pageContext":{"id":"3304b98d-22f6-5b4d-a2dd-926caa86a9fb"}}