{"data":{"contentfulPost":{"id":"5657ca55-0dc2-559e-a144-c2398196074f","fields":{"bodyFormatted":"<blockquote>\n<p>John 3:10</p>\n<p>&quot;Are you a teacher of Israel and don't know these things?&quot; Jesus replied.</p>\n</blockquote>\n<p>Jesus is talking to Nicodemus a teacher of the Old Testament or &quot;teacher of Israel&quot; who did not know what it meant to be &quot;born again&quot; through the power of the Holy Spirit. Jesus taught in John 3 that there is a birth of flesh and a birth of Spirit... flesh gives birth to flesh and Spirit gives birth to spirit and those who are born of flesh also need to be born of Spirit (John 3:6), called &quot;born again.&quot;</p>\n<blockquote>\n<p>John 3:3</p>\n<p>Jesus replied, &quot;I assure you: Unless someone is born again, he cannot see the kingdom of God.&quot;</p>\n</blockquote>\n<p>Nicodemus should have known about the Holy Spirit and even what it means to have new life and new direction from God because the Holy Spirit in the Old Testament gave people the ability to serve God and the prophesy of a new heart in Ezekiel 36 and the law written on the heart in Jeremiah 31 are a part of the Holy Spirit's work and regeneration.</p>\n<p>Numbers 11 brings us to a place where God is displeased along with Moses, with the grumbling and complaining of the Israelites. Moses asks God to &quot;please kill me right now&quot; (v. 15) and God's solution is not death but taking Moses leadership burden and giving it to others - 70 qualified older men who will lead with the power of the Holy Spirit.</p>\n<blockquote>\n<p>Numbers 11:16-17</p>\n<p>The LORD answered Moses, &quot;Bring Me 70 men from Israel known to you as elders and officers of the people. Take them to the tent of meeting and have them stand there with you. Then I will come down and speak with you there. I will take some of the Spirit who is on you and put the Spirit on them. They will help you bear the burden of the people, so that you do not have to bear it by yourself.&quot;</p>\n</blockquote>\n<p>An amazing thing takes place &quot;as the Spirit rested on them, they [70 elders] prophesied, but they never did it again.&quot; (Numbers 11:25) Two other men, Eldad and Medad who were on the elder list to come to the tent of meeting stayed in the camp - they also prophesied and it upset Moses' assistant Joshua, who thought they should be silenced... Moses' response is classic:</p>\n<blockquote>\n<p>Numbers 11:29</p>\n<p>&quot;If only all the LORD's people were prophets and the LORD would place His Spirit on them!&quot;</p>\n</blockquote>\n<p>Jesus over a thousand years later is ready to have the promise of the Holy Spirit poured out on &quot;all the LORD's people&quot;, this time for new life/identity in Christ and the purpose of seeing the kingdom and doing His work. Jesus gives us the term &quot;born again&quot; to describe the event. John the Baptist will use another term in Mark 1:8</p>\n<blockquote>\n<p>Mark 1:8</p>\n<p>&quot;I have baptized you with water, but He [Jesus] will baptize you with the Holy Spirit.&quot;</p>\n</blockquote>\n<p>What does it mean to be &quot;born again&quot; and what does it mean to be &quot;baptized&quot; by the Holy Spirit?</p>\n<p>Listen to what Jesus teaches about the Holy Spirit:</p>\n<blockquote>\n<p>John 14:16-18</p>\n<p>And I will ask the Father, and He will give you another Counselor to be with you forever. He is the Spirit of truth. The world is unable to receive Him because it doesn't see Him or know Him. But you do know Him, because He remains with you and will be in you. I will not leave you as orphans; I am coming to you.</p>\n</blockquote>\n<p>Before the cross Jesus let his disciples know the Holy Spirit remains with you but he uses a future tense to say the Spirit &quot;will be in you&quot; (John 14:23), when that happens they are no longer orphans but children of God because they have the Spirit of truth. Jesus teaches they will have both the Father and the Son dwell with them because of this event.</p>\n<blockquote>\n<p>John 14:23</p>\n<p>Jesus answered, &quot;If anyone loves Me, he will keep My word. My Father will love him, and We will come to him and make Our home with him.</p>\n</blockquote>\n<p>This event is Pentecost, when the Holy Spirit does indeed come down and empower Christ's disciples with His presence by taking up residence in these believers who will now have their identity in Christ (Galatians 2:19 &amp; 20).</p>\n<p>If you belong to Christ - you are Abraham's seed, heirs according to the promise:</p>\n<blockquote>\n<p>Galatians 3:27-29</p>\n<p>For as many of you as have been baptized into Christ have put on Christ like a garment. There is no Jew or Greek, slave or free, male or female; for you are all one in Christ Jesus. And if you belong to Christ, then you are Abraham's seed, heirs according to the promise.</p>\n</blockquote>\n<p>How are we Heirs?</p>\n<blockquote>\n<p>Galatians 4:6-7</p>\n<p>And because you are sons, God has sent the Spirit of His Son into our hearts, crying, &quot;Abba, Father!&quot; So you are no longer a slave but a son, and if a son, then an heir through God.</p>\n</blockquote>\n<p>When does this take place in the Christian Life?</p>\n<blockquote>\n<p>Titus 3:5-7</p>\n<p>He saved us—not by works of righteousness that we had done, but according to His mercy, through the washing of regeneration and renewal by the Holy Spirit. He poured out this Spirit on us abundantly through Jesus Christ our Savior, so that having been justified by His grace, we may become heirs with the hope of eternal life.</p>\n</blockquote>\n<p>Why do some Christians teach Baptism of the Holy Spirit as a second event not connected with &quot;the washing of regeneration and renewal by the Holy Spirit&quot;? The book of Acts is a transitional history moving from the Old Covenant of the Law which had many weaknesses to the New Covenant in Christ which had no weaknesses - it was perfect and perfecting forever as the Holy Spirit testified in Jeremiah 31 when God says I will never again remember their sins and their lawless acts (Heb. 10:17).</p>\n<p>At Pentecost when the Holy Spirit came to the disciples the mixed audience of travelers from around the Mediterranean area all heard in their own language (tongues) the power of God speak and Peter connected it to a prophecy in Joel 2:28 &quot;I will pour out my Spirit on all humanity... even on male and female slaves in those days&quot;</p>\n<p>Tongues as explained by Luke in the Acts 2 Pentecost experience:</p>\n<blockquote>\n<p>Acts 2:4</p>\n<p>Then they were all filled with the Holy Spirit and began to speak in different languages, as the Spirit gave them ability for speech.</p>\n</blockquote>\n<blockquote>\n<p>Acts 2:6</p>\n<p>When this sound occurred, a crowd came together and was confused because each one heard them speaking in his own language. 7 And they were astounded and amazed, saying, &quot;Look, aren't all these who are speaking Galileans? 8 How is it that each of us can hear in our own native language?</p>\n</blockquote>\n<p>These disciples of Christ before Pentecost had at best the presence of the Holy Spirit around them and on them - even in John 20:22 Jesus breathed on the disciples and commanded them to &quot;receive the Holy Spirit&quot; which indeed they would as they waited in Jerusalem for the outpouring of the Holy Spirit. After receiving the Holy Spirit these Galileans were given the ability to speak &quot;different languages&quot; that turned out being the &quot;native language&quot; of the Jewish pilgrim travelers.</p>\n<p>Can Gentiles become Christians?</p>\n<blockquote>\n<p>Acts 10:44-47</p>\n<p>While Peter was still speaking these words, the Holy Spirit came down on all those who heard the message. The circumcised believers who had come with Peter were astounded because the gift of the Holy Spirit had been poured out on the Gentiles also. For they heard them speaking in other languages and declaring the greatness of God. Then Peter responded, &quot;Can anyone withhold water and prevent these people from being baptized, who have received the Holy Spirit just as we have?</p>\n</blockquote>\n<p>&quot;Received the Holy Spirit just as we have&quot; - the day these Gentiles became Christians &quot;born again&quot; is the same day they were baptized in the Holy Spirit. Acts 10 is often overlooked by people who teach laying on of hands mentioned in Acts 8 and 19 as the main means of receiving the Holy Spirit as a second blessing, remember Acts is a transitional history of the New Covenant of the blood of Christ overtaking and superseding the Old Covenant and the blood of animals that could not take away sin. As the disciples were commanded to wait for the Holy Spirit in Jerusalem they changed over from Old Testament followers of Christ to New Covenant believers indwelt by the Holy Spirit, born again and baptized by the Holy Spirit. Today when a person puts their complete trust in Christ and surrenders their life to Him as Lord and Savior there is no waiting period of crossing over from death to life, the Holy Spirit who has convicted us of sin (John 16:8) stands ready to receive us as children of God and mark our identity in Christ.</p>\n<blockquote>\n<p>1 John 3:1-2</p>\n<p>Look at how great a love the Father has given us that we should be called God's children. And we are! The reason the world does not know us is that it didn't know Him. Dear friends, we are God's children now, and what we will be has not yet been revealed. We know that when He appears, we will be like Him because we will see Him as He is.</p>\n</blockquote>\n<p>The prophecy of John the Baptist in Mark 1:8 &quot;He will baptize you with the Holy Spirit&quot; can be a reality today in your life and the teaching of Jesus in John 3 to see the kingdom of God requires you to be &quot;born again&quot; or what Titus 3:5 calls &quot;regeneration&quot; from the Holy Spirit, both baptism and born again awaits those ready to call on the name of the Lord for salvation - what is keeping you from crossing over from death to life?</p>\n<p>Paul writing to Christians in Corinth to remind them the Holy Spirit now resides in them and they belong to God &quot;you are not your own.&quot;</p>\n<blockquote>\n<p>1 Corinthians 6:19-20</p>\n<p>Don't you know that your body is a sanctuary of the Holy Spirit who is in you, whom you have from God? You are not your own, for you were bought at a price. Therefore glorify God in your body.</p>\n</blockquote>\n"},"title":"The Holy Spirit - Born Again and Baptism","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2017-02-01"}},"pageContext":{"id":"5657ca55-0dc2-559e-a144-c2398196074f"}}