{"data":{"contentfulPost":{"id":"1cf010d8-28e8-5959-8cfd-98cf3a08ed77","fields":{"bodyFormatted":"<h3>Part 1 (Before the Law and Circumcision)</h3>\n<blockquote>\n<p>Genesis 15:1, 4</p>\n<p>After these things the word of the LORD came to Abram in a vision: &quot;Fear not, Abram, I am your shield; your reward shall be very great.&quot;<br/>\nAnd behold, the word of the LORD came to him...</p>\n</blockquote>\n<blockquote>\n<p>Genesis 15:6</p>\n<p>And he [Abraham] believed the LORD, and he [The LORD] counted it to him [Abraham] as righteousness.</p>\n</blockquote>\n<blockquote>\n<p>Romans 10:17</p>\n<p>So faith comes from hearing, and hearing through the word of Christ.</p>\n</blockquote>\n<p>Can you see the Old Testament pattern for becoming right with God?</p>\n<p>The Law will be given to the Israelites as a part of the covenant 400 years later so this &quot;counted it to him&quot; righteousness was given to Abraham before the Law and before instituted circumcision.</p>\n<p>Paul uses this in Romans 4 to teach us no one is made righteous (justified) before God by following the Law . . . and in Romans 3 the real purpose of the law is to announce we are sinners and to assure us that none of us meet God's righteous standard (Romans 3:10-11). Basically the law is there to shut us up and let us know we stand before God accountable as condemned for our sin (Romans 3:19-20). At this point you can either agree with God or disagree. Romans 4:20 No unbelief made him [Abraham] waver concerning the promise of God, but he grew strong in his faith as he gave glory to God, 21 fully convinced that God was able to do what he had promised. 22 That is why his faith was &quot;counted to him as righteousness.&quot; 23 But the words &quot;it was counted to him&quot; were not written for his sake alone, 24 but for ours also. It will be counted to us who believe in him who raised from the dead Jesus our Lord, 25 who was delivered up for our trespasses and raised for our justification. Romans 5:1 Therefore, since we have been justified by faith, we have peace with God through our Lord Jesus Christ. 2 Through him we have also obtained access by faith into this grace in which we stand, and we rejoice in hope of the glory of God. As Abraham becomes the New Testament Poster Child for Faith - take a quick look at his initial faith and where it came from - It follows Romans 10 - faith comes by hearing and hearing by the word of Christ -</p>\n<blockquote>\n<p>Genesis 15:1</p>\n<p>...the word of the LORD came to Abram...&quot;</p>\n</blockquote>\n<blockquote>\n<p>Genesis 15:4</p>\n<p>And behold, the word of the LORD came to him...&quot;</p>\n</blockquote>\n<blockquote>\n<p>Genesis 17:5</p>\n<p>No longer shall your name be called Abram, but your name shall be Abraham, for I have made you the father of a multitude of nations.</p>\n</blockquote>\n<p>&quot;I have made you the father&quot; is an example of the the prophetic future - God speaks in the past tense because it has already happened, even though it takes hundreds/thousands of years for this to occur. Genesis 17:6, 7, and 8 take the past tense action and translate it as a future event even though the literal Hebrew is in the perfect completed tense . . . I have made you exceedingly fruitful, I have made you a nation, I have established my covenant, I have given you and your offspring after you the land, I have become their God are all translated as future &quot;will&quot; to help the reader in the King James, New American Standard, and ESV understand they had not taken place yet but the truth is they had taken place because God said so.</p>\n<p>Fact check verb parsing on parah (fruitful) and nathan (make) using <a href=\"https://www.blueletterbible.org/kjv/gen/17/6/p0/t_conc_17006\">Blue Letter Bible</a></p>\n<p>This same prophetic future tense is used in Isaiah 53:5 &quot;he was pierced for our transgressions&quot; for a future event some 600 years in the making.</p>\n<h3>Part 2 - After the Law</h3>\n<p>Simply read all of Psalm 40 or all of Psalm 30, 31, 32, 33, 34 - they all testify David is a deeply wrecked sinful man and the only thing he can do is trust God for deliverance. As David declares God is his Rock and Refuge, is this the gospel of the Old Testament?</p>\n<p>Read all of Psalm 40 While taking note of how many times David gives credit to his church-priest tabernacle system. Psalm 40 is all about God's deliverance of David from sin and David wanting to talk only about God's character of mercy, steadfast love, faithfulness, and deliverance. It is a gospel centered on God's character while taking note and confessing one's lack of character (sin).</p>\n<p>Remember Jesus said to the Pharisees (religious people of the day) the tax collectors and prostitutes go into the kingdom of God before you because the Pharisees who were full of sin just like David would not repent (Matt. 21:32 &quot;change minds&quot;) and believe the message of John the Baptist.</p>\n<blockquote>\n<p>Ps. 40:12</p>\n<p>For evils have encompassed me beyond number; my iniquities have overtaken me,<br/>\nand I cannot see; they are more than the hairs of my head; my heart fails me.</p>\n</blockquote>\n<blockquote>\n<p>Ps. 40:17</p>\n<p>As for me, I am poor and needy, but the Lord takes thought for me. You are my help and my deliverer; do not delay, O my God!</p>\n</blockquote>\n<blockquote>\n<p>Ps . 30:2-4</p>\n<p>LORD my God, I cried to You for help, and You healed me.<br/>\nLORD, You brought me up from Sheol; You spared me from among those going down to the Pit.<br/>\nSing to Yahweh, you His faithful ones, and praise His holy name. (Holman Christian Standard Bible)</p>\n</blockquote>\n<blockquote>\n<p>Ps. 31:5</p>\n<p>Into your hand I commit my spirit; you have redeemed me, O LORD, faithful God.<br/></p>\n</blockquote>\n<blockquote>\n<p>Ps. 31:10</p>\n<p>For my life is spent with sorrow, and my years with sighing; my strength fails because of my iniquity, and my bones waste away.</p>\n</blockquote>\n<blockquote>\n<p>Psa. 32:1-2, 5</p>\n<p>Blessed is the one whose transgression is forgiven, whose sin is covered.<br/>\nBlessed is the man against whom the LORD counts no iniquity, and in whose spirit there is no deceit.<br/>\nI acknowledged my sin to you, and I did not cover my iniquity; I said, &quot;I will confess my transgressions to the LORD,&quot; and you forgave the iniquity of my sin. Selah</p>\n</blockquote>\n<blockquote>\n<p>Ps. 34:2-8</p>\n<p>My soul makes its boast in the LORD; let the humble hear and be glad.<br/>\nOh, magnify the LORD with me, and let us exalt his name together!<br/>\nI sought the LORD, and he answered me and delivered me from all my fears.<br/>\nThose who look to him are radiant, and their faces shall never be ashamed.<br/>\nThis poor man cried, and the LORD heard him and saved him out of all his troubles.<br/>\nThe angel of the LORD encamps around those who fear him, and delivers them.<br/>\nOh, taste and see that the LORD is good! Blessed is the man who takes refuge in him!</p>\n</blockquote>\n<p>If you were to sit down now and write out your testimony - would it sound like Psalm 30-34 or Psalm 40?</p>\n<p>Is your testimony in God's hand of deliverance or in your work?</p>\n<p>Is your testimony in your church, baptism, or the rules you keep, or what you believe?</p>\n<p>Is your testimony in your decision, your commitment, your uprightness?</p>\n<p>David in his testimony will not trust himself, or the might of the king, war horse, or warriors (33:16-17) his only trust is God who is good, merciful, steadfast in love.</p>\n<p><strong>The LORD is near to the brokenhearted and saves the crushed in spirit. - Psalm 34:18</strong></p>\n<p><strong>&quot;You're blessed when you're at the end of your rope [poor in spirit]. With less of you there is more of God and his rule. - Matthew 5:3 (The Message)</strong></p>\n"},"title":"Salvation in the Old Testament - Parts 1 & 2","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2017-01-11"}},"pageContext":{"id":"1cf010d8-28e8-5959-8cfd-98cf3a08ed77"}}