{"data":{"contentfulPost":{"id":"dced0e64-ebaa-5e33-8c6e-429fb7cddd4c","fields":{"bodyFormatted":"<p>His worse enemy is a brother who wants him dead (Gen. 27:41).</p>\n<p>The day before he meets his worse enemy, God handicaps him (Gen. 32:25).</p>\n<p>His boss changes his wages to his disadvantage not once but &quot;ten times&quot; in twenty years (Gen. 30:35-36, 31:7 &amp; 41).</p>\n<p>Right after he makes an agreement of his &quot;wages&quot; his boss takes it all away from him (Gen. 30:35) and later his boss' sons have it in for him (Gen. 31:1).</p>\n<p>He has to do a sneak escape from his boss who has grown to dislike him (Gen. 31).</p>\n<p>He is initially denied his first love, his oldest son sleeps with one of his wives (concubine), his father dies soon after his beloved wife dies giving birth (Gen. 29:25, Gen. 35:18, 22, 28).</p>\n<p>His beloved daughter is raped (Gen. 34:2).</p>\n<p>After his daughter is raped he is forced into a covenant with wicked people (Gen. 34).</p>\n<p>Two of his rebellious sons put his life and entire family in danger by taking revenge (Gen. 34:30).</p>\n<p>When he was running for his life as a refugee he found a rock or stone to use as a pillow (Gen. 28:18) - Have you figured out who this <strong>blessed stone pillow refugee</strong> is yet?</p>\n<p>His beloved son is stripped by his brothers and thrown into a pit, kidnapped and sold into slavery but he is told his son has been killed by a wild animal (Gen. 37:23-33).</p>\n<p>His father is deceived into giving him a blessing that asks the LORD to &quot;give you of the dew of heaven and of the fatness of the earth and <strong>plenty of grain</strong> and wine&quot; yet a drought drives him to give up his youngest son to go to Egypt so they can get food to live (Gen. 27:37-40).</p>\n<p>He finds out his sons plotted to kill his beloved son but instead sold him as a slave (Gen. 45:26).</p>\n<p>The Pharoah of Egypt will give his family the &quot;best of the land of Egypt, and you shall eat the fat of the land&quot; (Gen. 45:18) but when Pharoah asks him about his <strong>130 year old</strong> life, the summary statement is:</p>\n<p><strong>&quot;Few and evil have been the days of the years of my life&quot; (Gen. 47:9)</strong></p>\n<p>Almost overnight Jacob, the mama's boy, went from a smooth man who lived in tents of luxury to a stone pillow refugee without tent or pillow or mama (Gen. 25:27, 27:11, and 28:18).</p>\n<p>About 20 years later on his return to the homeland:</p>\n<p>The setting in Genesis 32 starts with a very encouraging thought:</p>\n<p>v. 1 Jacob went on his way, and the angels of God met him.</p>\n<p>Then Jacob finds out his brother is coming to meet him with 400 men - Jacob has two possible responses:</p>\n<ol>\n<li>Trust God to deliver him like God promised at Bethel 20 years ago</li>\n<li>Get greatly afraid and distressed.</li>\n</ol>\n<p>Jacob chose the greatly distressed route - this may be why God sent a messenger to wrestle him.</p>\n<p>Jacob deploys a scheme of sending lots of presents ahead of him to appease his brother's wrath, Jacob decides to set up 2 camps with the first camp going out ahead as a guinea pig test to see if they get slaughtered and enough room and time for him to run away. Why not just trust God to do what he promised in v. 9</p>\n<p>'Return to your country and to your kindred, that I may do you good,'</p>\n<p>It is Jacob's hour of desperation and he cries out something God loves to hear because it is the truth of a blessed life.</p>\n<p>I am not worthy of the least of all the deeds of steadfast love and all the faithfulness that you have shown to your servant (Gen. 32:10).</p>\n<p>After the wrestling match Jacob names the place: face of God (Peniel -Gen. 32:30).</p>\n<p>His blessed life is much different from nice cars, big houses, happy children, thinking you can petition and manipulate God with the right phrase because God owes you.</p>\n<p>The blessed life is knowing there is a Potter and we are the clay.</p>\n<p>The blessed life is little children who can't take care of themselves in any way and they are completely dependent on God for everything.</p>\n<p>The blessed life is having everything fall apart because of sin, rebellion, fickle faith and still having a &quot;fortress&quot; to run to and a place for a wasteful son to be embraced by his father.</p>\n<p>&quot;<strong>Be still</strong>, and <strong>know that I am God</strong>. I will be exalted among the nations, I will be exalted in the earth!&quot; The LORD of hosts is with us; <strong>the God of Jacob</strong> is our fortress. Selah -Psalm 46</p>\n<p><em>The phrase &quot;the God of Jacob&quot; gets used many times (12 times in the book of Psalm) to show God fights for those who trust in Him.</em></p>\n<p>We see this in the New Testament and understand why God loves broken sinners and dependent little children and why the kingdom and rule of God belongs to these.</p>\n<blockquote>\n<p>Luke 18:13-17</p>\n<p>But the tax collector, standing far off, would not even lift up his eyes to heaven, but beat his breast, saying, 'God, be merciful to me, a sinner!' I tell you, this man went down to his house justified, rather than the other. For everyone who exalts himself will be humbled, but the one who humbles himself will be exalted.&quot;<br/></p>\n<p>Now they were bringing even infants to him that he might touch them. And when the disciples saw it, they rebuked them. But Jesus called them to him, saying, &quot;Let the children come to me, and do not hinder them, for to such belongs the kingdom of God. Truly, I say to you, whoever does not receive the kingdom of God like a child shall not enter it.&quot;</p>\n</blockquote>\n<p>Would you still consider Jacob to have a blessed life after reading some of the descriptions given in the Bible of all the messes he went through in his personal and family life?</p>\n<p>Why does the Psalmist choose Jacob instead of the &quot;righteous&quot; Noah, Job, or even Abraham - what is the Psalmist communicating when he says: &quot;The LORD of the armies; the God of Jacob&quot; ?</p>\n<p>Note: Even Jesus uses the term &quot;God of Jacob&quot; to address Sadducees who stopped believing in the power of God through His Word. (Matt. 22:29-33).</p>\n<p>Prayer:</p>\n<p>Today, God, I want to have only You as my Fortress - my place and person of refuge and relief. Help me to understand Your goodness and forgiveness You offer to people like Jacob who ran from you and even wrestled with you (Israel). Your invitation for the wasteful son (prodigal) to come home still stands today. You are the God of Jacob and other messed up people like myself who call on your name in humility and brokenness.</p>\n<p>Thank you.</p>\n"},"title":"The Testimony of a Blessed Life","author":[{"id":"ef7bd1b1-c63a-54dc-9ffe-db36e1bb7217","name":"Sam Coleman","photo":null}],"date":"2016-11-30"}},"pageContext":{"id":"dced0e64-ebaa-5e33-8c6e-429fb7cddd4c"}}